## 🏗️ Terraform Plan Summary

**🌎 Terraform Workspace:** `default`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ❌ `failure` |

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.
```

</details>

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
data.terraform_remote_state.main: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket.artifact_service will be created
  + resource "google_storage_bucket" "artifact_service" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # google_vertex_ai_reasoning_engine.session_and_memory will be created
  + resource "google_vertex_ai_reasoning_engine" "session_and_memory" {
      + create_time  = (known after apply)
      + description  = "Managed Session and Memory Bank Service for the skills_agent-default app"
      + display_name = "skills_agent-default Sessions and Memory"
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "onix-lnd"
      + update_time  = (known after apply)

      + spec {
        }
    }

  # random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + agent_engine                     = (known after apply)
  + agent_name                       = "skills_agent"
  + artifact_service_uri             = (known after apply)
  + configured_environment_variables = {
      + ADK_SUPPRESS_EXPERIMENTAL_FEATURE_WARNINGS         = "TRUE"
      + AGENT_ENGINE                                       = (known after apply)
      + AGENT_NAME                                         = "skills_agent"
      + ALLOW_ORIGINS                                      = jsonencode(
            [
              + "http://127.0.0.1",
              + "http://127.0.0.1:8000",
            ]
        )
      + ARTIFACT_SERVICE_URI                               = (known after apply)
      + GOOGLE_CLOUD_LOCATION                              = "us-central1"
      + GOOGLE_CLOUD_PROJECT                               = "onix-lnd"
      + GOOGLE_GENAI_USE_VERTEXAI                          = "TRUE"
      + LOG_LEVEL                                          = "INFO"
      + OTEL_INSTRUMENTATION_GENAI_CAPTURE_MESSAGE_CONTENT = "TRUE"
      + RELOAD_AGENTS                                      = "FALSE"
      + ROOT_AGENT_MODEL                                   = "gemini-2.5-flash"
      + SERVE_WEB_INTERFACE                                = "FALSE"
      + TELEMETRY_NAMESPACE                                = "default"
    }
  + deployed_image                   = "us-central1-docker.pkg.dev/onix-lnd/skills-agent/skills_agent@sha256:a4fe6897e2c2c5ee853e53c1753f2761bf9e74055cb6a950fc39b3ebeaf3b06b"
  + location                         = "us-central1"
  + project                          = "onix-lnd"
  + service_account_roles            = [
      + "roles/aiplatform.user",
      + "roles/cloudtrace.agent",
      + "roles/logging.logWriter",
      + "roles/serviceusage.serviceUsageConsumer",
      + "roles/storage.bucketViewer",
      + "roles/storage.objectUser",
      + "roles/telemetry.tracesWriter",
    ]
  + terraform_state_bucket           = "terraform-state-skills_agent-dbf19ce2"

Error: "account_id" ("skills_agent-default") must match regex "^[a-z]([-a-z0-9]*[a-z0-9])?$"

  with google_service_account.app,
  on main.tf line 63, in resource "google_service_account" "app":
  63:   account_id   = local.sa_id
```

</details>

---